<?php


namespace common\helpers;


class DonntuSections
{
    public static function getDonntuSections()
    {
        return [
            'ИУС' => [
                'СИСТЕМА' => 0.85,
                'СУБД' => 0.9,
                'ТЕХНОЛОГИЯ' => 0.4,
                'ОБЪЕКТ' => 0.6,
                'ДАННЫЕ' => 0.4,
                'ИНФОРМАЦИЯ' => 0.45,
                'ПОИСК' => 0.4,
                'УПРАВЛЕНИЕ' => 0.4,
                'ПОДСИСТЕМА' => 0.67,
                'АНАЛИЗ' => 0.5,
                'БАЗА' => 0.7,
                'ЗАПРОС' => 0.6
            ],
            'КМ' => [
                'МОДЕЛИРОВАНИЕ' => 0.9,
                'ФИГУРА' => 0.7,
                'МОДЕЛЬ' => 0.5,
                'ДИЗАЙН' => 0.8,
                'ЧЕРТЁЖ' => 0.7,
                'ОБЪЕКТ' => 0.3,
                'AUTOCAD' => 0.8,
                'ИЗОБРАЖЕНИЕ' => 0.7,
                'ТОЧКА' => 0.76,
                'МНОГОУГОЛЬНИК' => 0.5,
                'ПРОСТРАНСТВО' => 0.4,
                'АНАЛИЗ' => 0.2
            ],
            'ТЕХНОЛОГИИ И СИСТЕМЫ ИСКУССТВЕННОГО ИНТЕЛЛЕКТА' => [
                'АЛГОРИТМ' => 0.85,
                'ИНТЕЛЛЕКТ' => 0.9,
                'СИСТЕМА' => 0.5,
                'ОБУЧЕНИЕ' => 0.6,
                'МЕТРИКА' => 0.6,
                'РАСПОЗНАВАНИЕ' => 0.7,
                'СЕТЬ' => 0.6,
                'НЕЙРОСЕТЬ' => 0.7,
                'ЗНАНИЯ' => 0.6,
                'НАКОПЛЕНИЕ' => 0.8,
                'ВИЗУАЛИЗАЦИЯ' => 0.4,
                'ДАННЫЕ' => 0.3
            ],
//            'WEB-ТЕХНОЛОГИИ И КОМПЬЮТЕРНЫЙ ДИЗАЙН' => [
//                'HTML' => 0.85,
//                'CSS' => 0.9,
//                'PHP' => 0.9,
//                'SQL' => 0.7
//            ],
        ];
    }
}